Ran Plan for 2 projects:

1. dir: `terragrunt/live/aws/ap-southeast-1/dev/ec2` workspace: `default`
1. dir: `terragrunt/live/aws/ap-southeast-1/dev/vpc` workspace: `default`

### 1. dir: `terragrunt/live/aws/ap-southeast-1/dev/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-03-31T02:19:38Z level=warning msg=No double-slash (//) found in source URL /root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/modules/aws/vpc. Relative paths in downloaded Terraform code may not work. prefix=[/root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/live/aws/ap-southeast-1/dev/vpc] 
time=2023-03-31T02:19:41Z level=warning msg=No double-slash (//) found in source URL /root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/modules/aws/ec2. Relative paths in downloaded Terraform code may not work.
data.aws_key_pair.demo_deployer: Reading...
data.aws_key_pair.demo_deployer: Read complete after 0s [id=key-03e4114fa84c70168]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.default[0] will be created
  + resource "aws_instance" "default" {
      + ami                                  = "ami-05c8486d62efc5d07"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "demo-deployer"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "dev-demo-app"
        }
      + tags_all                             = {
          + "Name" = "dev-demo-app"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }
    }

  # aws_network_interface.default_interface will be created
  + resource "aws_network_interface" "default_interface" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = [
          + "DUMMY_VPC_ID",
        ]
      + source_dest_check         = true
      + subnet_id                 = "DUMMY_SUBNET_ID"
      + tags_all                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/live/aws/ap-southeast-1/dev/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/live/aws/ap-southeast-1/dev/ec2/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/live/aws/ap-southeast-1/dev/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://54.179.60.167/lock?id=rdnuansa%252Fdemo-atlantis%252Fterragrunt%252Flive%252Faws%252Fap-southeast-1%252Fdev%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/live/aws/ap-southeast-1/dev/ec2`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terragrunt/live/aws/ap-southeast-1/dev/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-03-31T02:19:51Z level=warning msg=No double-slash (//) found in source URL /root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/modules/aws/vpc. Relative paths in downloaded Terraform code may not work.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.main_sg will be created
  + resource "aws_security_group" "main_sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH, and HTTP"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "dev-demo-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.main_subnet will be created
  + resource "aws_subnet" "main_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-demo-subnet"
        }
      + tags_all                                       = {
          + "Name" = "dev-demo-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main_vpc will be created
  + resource "aws_vpc" "main_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "dev-demo-vpc"
        }
      + tags_all                             = {
          + "Name" = "dev-demo-vpc"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_security_group_id = (known after apply)
  + subnet_id             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/live/aws/ap-southeast-1/dev/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/demo-atlantis/2/default/terragrunt/live/aws/ap-southeast-1/dev/vpc/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/live/aws/ap-southeast-1/dev/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://54.179.60.167/lock?id=rdnuansa%252Fdemo-atlantis%252Fterragrunt%252Flive%252Faws%252Fap-southeast-1%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/live/aws/ap-southeast-1/dev/vpc`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`